kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Drivers/BSP/STM32F4-Discovery/stm32f4_tony.h
/**
  ******************************************************************************
  * @file    stm32f4_tony.h
  * @author  ADDING Team
  * @version V1.0.0
  * @date    26-11-2014
  * @brief   This file provides the AFE4490 Codec driver.   
  ******************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4_DISCOVERY_H
#define __STM32F4_DISCOVERY_H

#ifdef __cplusplus
 extern "C" {
#endif
                                              
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
   
/** @addtogroup BSP
  * @{
  */ 

/** @addtogroup STM32F4_DISCOVERY
  * @{
  */ 
      
/** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL
  * @{
  */ 

/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Types
  * @{
  */
typedef enum 
{
  LED0 = 0,
  LED1 = 1,
  LED2 = 2,
  LED3 = 3
} Led_TypeDef;

typedef enum 
{  
  BUTTON_KEY = 0,
} Button_TypeDef;

typedef enum 
{  
  BUTTON_MODE_GPIO = 0,
  BUTTON_MODE_EXTI = 1
} ButtonMode_TypeDef;     
/**
  * @}
  */ 

/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Constants
  * @{
  */ 

/** 
* @brief  Define for STM32F4_DISCOVERY board  
*/ 
#if !defined (USE_STM32F4_DISCO)
 #define USE_STM32F4_DISCO
#endif
/*********************************************************************/
///////////////////LED PIN 
/**********************************************************************/
/** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL_LED
  * @{
  */
#define LEDn                             4


#define LED0_PIN                         GPIO_PIN_0
#define LED0_GPIO_PORT                   GPIOC
#define LED0_GPIO_CLK_ENABLE()           __GPIOC_CLK_ENABLE()  
#define LED0_GPIO_CLK_DISABLE()          __GPIOC_CLK_DISABLE()  

#define LED1_PIN                         GPIO_PIN_1
#define LED1_GPIO_PORT                   GPIOC
#define LED1_GPIO_CLK_ENABLE()           __GPIOC_CLK_ENABLE()  
#define LED1_GPIO_CLK_DISABLE()          __GPIOC_CLK_DISABLE()  

#define LED2_PIN                         GPIO_PIN_1
#define LED2_GPIO_PORT                   GPIOA
#define LED2_GPIO_CLK_ENABLE()           __GPIOA_CLK_ENABLE()  
#define LED2_GPIO_CLK_DISABLE()          __GPIOA_CLK_DISABLE()  

#define LED3_PIN                         GPIO_PIN_3
#define LED3_GPIO_PORT                   GPIOF
#define LED3_GPIO_CLK_ENABLE()           __GPIOF_CLK_ENABLE()  
#define LED3_GPIO_CLK_DISABLE()          __GPIOF_CLK_DISABLE()  


#define LEDx_GPIO_CLK_ENABLE(__INDEX__)   (((__INDEX__) == 0) ? LED0_GPIO_CLK_ENABLE() :\
                                           ((__INDEX__) == 1) ? LED1_GPIO_CLK_ENABLE() :\
                                           ((__INDEX__) == 2) ? LED2_GPIO_CLK_ENABLE() : LED3_GPIO_CLK_ENABLE())

#define LEDx_GPIO_CLK_DISABLE(__INDEX__)  (((__INDEX__) == 0) ? LED0_GPIO_CLK_DISABLE() :\
                                           ((__INDEX__) == 1) ? LED1_GPIO_CLK_DISABLE() :\
                                           ((__INDEX__) == 2) ? LED2_GPIO_CLK_DISABLE() : LED3_GPIO_CLK_DISABLE())

///**
//  * @}
//  */ 
//  
///** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL_BUTTON
//  * @{
//  */  
//#define BUTTONn                          1  

///**
// * @brief Wakeup push-button
// */
//#define KEY_BUTTON_PIN                GPIO_PIN_0
//#define KEY_BUTTON_GPIO_PORT          GPIOA
//#define KEY_BUTTON_GPIO_CLK_ENABLE()  __GPIOA_CLK_ENABLE()
//#define KEY_BUTTON_GPIO_CLK_DISABLE() __GPIOA_CLK_DISABLE()
//#define KEY_BUTTON_EXTI_IRQn          EXTI0_IRQn 


//#define BUTTONx_GPIO_CLK_ENABLE(__INDEX__)    (KEY_BUTTON_GPIO_CLK_ENABLE())

//#define BUTTONx_GPIO_CLK_DISABLE(__INDEX__)    (KEY_BUTTON_GPIO_CLK_DISABLE())
///**
//  * @}
//  */ 
//  
///** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL_BUS
//  * @{
//  */  

///*############################### SPI1 #######################################*/
//#define DISCOVERY_SPIx                              SPI1
//#define DISCOVERY_SPIx_CLK_ENABLE()                 __SPI1_CLK_ENABLE()
//#define DISCOVERY_SPIx_GPIO_PORT                    GPIOA                      /* GPIOA */
//#define DISCOVERY_SPIx_AF                           GPIO_AF5_SPI1
//#define DISCOVERY_SPIx_GPIO_CLK_ENABLE()            __GPIOA_CLK_ENABLE()
//#define DISCOVERY_SPIx_GPIO_CLK_DISABLE()           __GPIOA_CLK_DISABLE()
//#define DISCOVERY_SPIx_SCK_PIN                      GPIO_PIN_5                 /* PA.05 */
//#define DISCOVERY_SPIx_MISO_PIN                     GPIO_PIN_6                 /* PA.06 */
//#define DISCOVERY_SPIx_MOSI_PIN                     GPIO_PIN_7                 /* PA.07 */

///* Maximum Timeout values for flags waiting loops. These timeouts are not based
//   on accurate values, they just guarantee that the application will not remain
//   stuck if the SPI communication is corrupted.
//   You may modify these timeout values depending on CPU frequency and application
//   conditions (interrupts routines ...). */   
//#define SPIx_TIMEOUT_MAX                            0x1000 /*<! The value of the maximal timeout for BUS waiting loops */


///*############################# I2C1 #########################################*/
///* I2C clock speed configuration (in Hz) */
//#ifndef I2C_SPEED
// #define I2C_SPEED                            100000
//#endif /* I2C_SPEED */

///* I2C peripheral configuration defines (control interface of the audio codec) */
//#define DISCOVERY_I2Cx                            I2C1
//#define DISCOVERY_I2Cx_CLK_ENABLE()               __I2C1_CLK_ENABLE()
//#define DISCOVERY_I2Cx_SCL_SDA_GPIO_CLK_ENABLE()  __GPIOB_CLK_ENABLE()
//#define DISCOVERY_I2Cx_SCL_SDA_AF                 GPIO_AF4_I2C1
//#define DISCOVERY_I2Cx_SCL_SDA_GPIO_PORT          GPIOB
//#define DISCOVERY_I2Cx_SCL_PIN                    GPIO_PIN_6
//#define DISCOVERY_I2Cx_SDA_PIN                    GPIO_PIN_9

//#define DISCOVERY_I2Cx_FORCE_RESET()              __I2C1_FORCE_RESET()
//#define DISCOVERY_I2Cx_RELEASE_RESET()            __I2C1_RELEASE_RESET()

///* I2C interrupt requests */                  
//#define DISCOVERY_I2Cx_EV_IRQn                    I2C1_EV_IRQn
//#define DISCOVERY_I2Cx_ER_IRQn                    I2C1_ER_IRQn

///* Maximum Timeout values for flags waiting loops. These timeouts are not based
//   on accurate values, they just guarantee that the application will not remain
//   stuck if the SPI communication is corrupted.
//   You may modify these timeout values depending on CPU frequency and application
//   conditions (interrupts routines ...). */   
//#define I2Cx_TIMEOUT_MAX    0x1000 /*<! The value of the maximal timeout for BUS waiting loops */


///*############################# ACCELEROMETER ################################*/
///* Read/Write command */
//#define READWRITE_CMD                     ((uint8_t)0x80) 
///* Multiple byte read/write command */ 
//#define MULTIPLEBYTE_CMD                  ((uint8_t)0x40)
///* Dummy Byte Send by the SPI Master device in order to generate the Clock to the Slave device */
//#define DUMMY_BYTE                        ((uint8_t)0x00)

///* Chip Select macro definition */
//#define ACCELERO_CS_LOW()       HAL_GPIO_WritePin(ACCELERO_CS_GPIO_PORT, ACCELERO_CS_PIN, GPIO_PIN_RESET)
//#define ACCELERO_CS_HIGH()      HAL_GPIO_WritePin(ACCELERO_CS_GPIO_PORT, ACCELERO_CS_PIN, GPIO_PIN_SET)

///**
//  * @brief  ACCELEROMETER Interface pins
//  */
//#define ACCELERO_CS_PIN                        GPIO_PIN_3                 /* PE.03 */
//#define ACCELERO_CS_GPIO_PORT                  GPIOE                      /* GPIOE */
//#define ACCELERO_CS_GPIO_CLK_ENABLE()          __GPIOE_CLK_ENABLE()
//#define ACCELERO_CS_GPIO_CLK_DISABLE()         __GPIOE_CLK_DISABLE()
//#define ACCELERO_INT_GPIO_PORT                 GPIOE                      /* GPIOE */
//#define ACCELERO_INT_GPIO_CLK_ENABLE()         __GPIOE_CLK_ENABLE()
//#define ACCELERO_INT_GPIO_CLK_DISABLE()        __GPIOE_CLK_DISABLE()
//#define ACCELERO_INT1_PIN                      GPIO_PIN_0                 /* PE.00 */
//#define ACCELERO_INT1_EXTI_IRQn                EXTI0_IRQn 
//#define ACCELERO_INT2_PIN                      GPIO_PIN_1                 /* PE.01 */
//#define ACCELERO_INT2_EXTI_IRQn                EXTI1_IRQn 
///**
//  * @}
//  */ 


///*############################### AUDIO ######################################*/
///**
//  * @brief  AUDIO I2C Interface pins
//  */
//#define AUDIO_I2C_ADDRESS                     0x94
//  
//  /* Audio Reset Pin definition */
//#define AUDIO_RESET_GPIO_CLK_ENABLE()         __GPIOD_CLK_ENABLE()
//#define AUDIO_RESET_PIN                       GPIO_PIN_4
//#define AUDIO_RESET_GPIO                      GPIOD
///**
//  * @}
//  */ 

///**
//  * @}
//  */ 

///** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Macros
//  * @{
//  */  
///**
//  * @}
//  */ 

///** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Functions
//  * @{
//  */


//***************************************************************//
//UART PIN DEFINE
///**************************************************************//
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
extern UART_HandleTypeDef huart1;
/* User can use this section to tailor USARTx/UARTx instance used and associated 
   resources */
/* Definition for USARTx clock resources */
#define USARTx                           USART1
#define USARTx_CLK_ENABLE()              __USART1_CLK_ENABLE();
#define DMAx_CLK_ENABLE()                __DMA2_CLK_ENABLE()
#define USARTx_RX_GPIO_CLK_ENABLE()      __GPIOA_CLK_ENABLE()
#define USARTx_TX_GPIO_CLK_ENABLE()      __GPIOA_CLK_ENABLE() 

#define USARTx_FORCE_RESET()             __USART1_FORCE_RESET()
#define USARTx_RELEASE_RESET()           __USART1_RELEASE_RESET()

/* Definition for USARTx Pins */
#define USARTx_TX_PIN                    GPIO_PIN_9
#define USARTx_TX_GPIO_PORT              GPIOA
#define USARTx_TX_AF                     GPIO_AF7_USART1
#define USARTx_RX_PIN                    GPIO_PIN_10
#define USARTx_RX_GPIO_PORT              GPIOA
#define USARTx_RX_AF                     GPIO_AF7_USART1

/* Definition for USARTx's DMA */
#define USARTx_TX_DMA_CHANNEL             DMA_CHANNEL_4
#define USARTx_TX_DMA_STREAM              DMA2_Stream7
#define USARTx_RX_DMA_CHANNEL             DMA_CHANNEL_4
#define USARTx_RX_DMA_STREAM              DMA2_Stream2

/* Definition for USARTx's NVIC */
#define USARTx_DMA_TX_IRQn                DMA2_Stream7_IRQn
#define USARTx_DMA_RX_IRQn                DMA2_Stream2_IRQn
#define USARTx_DMA_TX_IRQHandler          DMA2_Stream7_IRQHandler
#define USARTx_DMA_RX_IRQHandler          DMA2_Stream2_IRQHandler

#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
/* Size of Transmission buffer */
#define TXBUFFERSIZE                     (COUNTOF(aTxBuffer) - 1)
/* Size of Reception buffer */
#define RXBUFFERSIZE                      TXBUFFERSIZE

uint32_t BSP_GetVersion(void);
void     BSP_LED_Init(Led_TypeDef Led);
void     BSP_LED_On(Led_TypeDef Led);
void     BSP_LED_Off(Led_TypeDef Led);
void     BSP_LED_Toggle(Led_TypeDef Led);
void     BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef Mode);
uint32_t BSP_PB_GetState(Button_TypeDef Button);
extern   uint8_t AFE44xx_ADRDY;
//extern long * AFE44xx_RecData(void);
/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */
  
#ifdef __cplusplus
}
#endif

#endif /* __STM32F4_DISCOVERY_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
